---
kind: property
id: P:Autodesk.Revit.DB.ViewSchedule.IsTitleblockRevisionSchedule
zh: 明细表
source: html/21cbed70-7510-4321-4878-8b60d40b3e7e.htm
---
# Autodesk.Revit.DB.ViewSchedule.IsTitleblockRevisionSchedule Property

**中文**: 明细表

Identifies if this ViewSchedule is an internal schedule used to display revision schedules as part of a titleblock.

## Syntax (C#)
```csharp
public bool IsTitleblockRevisionSchedule { get; }
```

## Remarks
These schedules cannot be modified by the user or placed on sheets.